out/production/WebshopClient/service/1.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MyService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/WebshopService"/><xs:element name="LoginCheck"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="username" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="password" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="LoginCheckResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="LoginCheckResult" nillable="true" type="q1:Customer" xmlns:q1="http://schemas.datacontract.org/2004/07/WebshopService"/></xs:sequence></xs:complexType></xs:element><xs:element name="RegisterCheck"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="username" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="RegisterCheckResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="RegisterCheckResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetCustomerById"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="id" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetCustomerByIdResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetCustomerByIdResult" nillable="true" type="q2:Customer" xmlns:q2="http://schemas.datacontract.org/2004/07/WebshopService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetProducts"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="GetProductsResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetProductsResult" nillable="true" type="q3:ArrayOfProduct" xmlns:q3="http://schemas.datacontract.org/2004/07/WebshopService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetProductsFromCustomer"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="customerId" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetProductsFromCustomerResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetProductsFromCustomerResult" nillable="true" type="q4:ArrayOfProduct" xmlns:q4="http://schemas.datacontract.org/2004/07/WebshopService"/></xs:sequence></xs:complexType></xs:element><xs:element name="BuyProduct"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="product" nillable="true" type="q5:Product" xmlns:q5="http://schemas.datacontract.org/2004/07/WebshopService"/><xs:element minOccurs="0" name="customer" nillable="true" type="q6:Customer" xmlns:q6="http://schemas.datacontract.org/2004/07/WebshopService"/></xs:sequence></xs:complexType></xs:element><xs:element name="BuyProductResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="BuyProductResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/WebshopService" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/WebshopService"><xs:complexType name="Customer"><xs:sequence><xs:element minOccurs="0" name="Balance" type="xs:double"/><xs:element minOccurs="0" name="CustomerId" type="xs:int"/><xs:element minOccurs="0" name="Password" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="PaymentRule" nillable="true" type="tns:ArrayOfPaymentRule"/><xs:element minOccurs="0" name="Username" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Customer" nillable="true" type="tns:Customer"/><xs:complexType name="ArrayOfPaymentRule"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="PaymentRule" nillable="true" type="tns:PaymentRule"/></xs:sequence></xs:complexType><xs:element name="ArrayOfPaymentRule" nillable="true" type="tns:ArrayOfPaymentRule"/><xs:complexType name="PaymentRule"><xs:sequence><xs:element minOccurs="0" name="Amount" type="xs:int"/><xs:element minOccurs="0" name="Customers" nillable="true" type="tns:Customer"/><xs:element minOccurs="0" name="PaymentRuleId" type="xs:int"/><xs:element minOccurs="0" name="Product" nillable="true" type="tns:Product"/></xs:sequence></xs:complexType><xs:element name="PaymentRule" nillable="true" type="tns:PaymentRule"/><xs:complexType name="Product"><xs:sequence><xs:element minOccurs="0" name="Name" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="PaymentRules" nillable="true" type="tns:ArrayOfPaymentRule"/><xs:element minOccurs="0" name="Price" type="xs:double"/><xs:element minOccurs="0" name="ProductId" type="xs:int"/><xs:element minOccurs="0" name="Stock" type="xs:int"/></xs:sequence></xs:complexType><xs:element name="Product" nillable="true" type="tns:Product"/><xs:complexType name="ArrayOfProduct"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Product" nillable="true" type="tns:Product"/></xs:sequence></xs:complexType><xs:element name="ArrayOfProduct" nillable="true" type="tns:ArrayOfProduct"/></xs:schema></wsdl:types><wsdl:message name="IMyService_LoginCheck_InputMessage"><wsdl:part name="parameters" element="tns:LoginCheck"/></wsdl:message><wsdl:message name="IMyService_LoginCheck_OutputMessage"><wsdl:part name="parameters" element="tns:LoginCheckResponse"/></wsdl:message><wsdl:message name="IMyService_RegisterCheck_InputMessage"><wsdl:part name="parameters" element="tns:RegisterCheck"/></wsdl:message><wsdl:message name="IMyService_RegisterCheck_OutputMessage"><wsdl:part name="parameters" element="tns:RegisterCheckResponse"/></wsdl:message><wsdl:message name="IMyService_GetCustomerById_InputMessage"><wsdl:part name="parameters" element="tns:GetCustomerById"/></wsdl:message><wsdl:message name="IMyService_GetCustomerById_OutputMessage"><wsdl:part name="parameters" element="tns:GetCustomerByIdResponse"/></wsdl:message><wsdl:message name="IMyService_GetProducts_InputMessage"><wsdl:part name="parameters" element="tns:GetProducts"/></wsdl:message><wsdl:message name="IMyService_GetProducts_OutputMessage"><wsdl:part name="parameters" element="tns:GetProductsResponse"/></wsdl:message><wsdl:message name="IMyService_GetProductsFromCustomer_InputMessage"><wsdl:part name="parameters" element="tns:GetProductsFromCustomer"/></wsdl:message><wsdl:message name="IMyService_GetProductsFromCustomer_OutputMessage"><wsdl:part name="parameters" element="tns:GetProductsFromCustomerResponse"/></wsdl:message><wsdl:message name="IMyService_BuyProduct_InputMessage"><wsdl:part name="parameters" element="tns:BuyProduct"/></wsdl:message><wsdl:message name="IMyService_BuyProduct_OutputMessage"><wsdl:part name="parameters" element="tns:BuyProductResponse"/></wsdl:message><wsdl:portType name="IMyService"><wsdl:operation name="LoginCheck"><wsdl:input wsaw:Action="http://tempuri.org/IMyService/LoginCheck" message="tns:IMyService_LoginCheck_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMyService/LoginCheckResponse" message="tns:IMyService_LoginCheck_OutputMessage"/></wsdl:operation><wsdl:operation name="RegisterCheck"><wsdl:input wsaw:Action="http://tempuri.org/IMyService/RegisterCheck" message="tns:IMyService_RegisterCheck_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMyService/RegisterCheckResponse" message="tns:IMyService_RegisterCheck_OutputMessage"/></wsdl:operation><wsdl:operation name="GetCustomerById"><wsdl:input wsaw:Action="http://tempuri.org/IMyService/GetCustomerById" message="tns:IMyService_GetCustomerById_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMyService/GetCustomerByIdResponse" message="tns:IMyService_GetCustomerById_OutputMessage"/></wsdl:operation><wsdl:operation name="GetProducts"><wsdl:input wsaw:Action="http://tempuri.org/IMyService/GetProducts" message="tns:IMyService_GetProducts_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMyService/GetProductsResponse" message="tns:IMyService_GetProducts_OutputMessage"/></wsdl:operation><wsdl:operation name="GetProductsFromCustomer"><wsdl:input wsaw:Action="http://tempuri.org/IMyService/GetProductsFromCustomer" message="tns:IMyService_GetProductsFromCustomer_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMyService/GetProductsFromCustomerResponse" message="tns:IMyService_GetProductsFromCustomer_OutputMessage"/></wsdl:operation><wsdl:operation name="BuyProduct"><wsdl:input wsaw:Action="http://tempuri.org/IMyService/BuyProduct" message="tns:IMyService_BuyProduct_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IMyService/BuyProductResponse" message="tns:IMyService_BuyProduct_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IMyService" type="tns:IMyService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="LoginCheck"><soap:operation soapAction="http://tempuri.org/IMyService/LoginCheck" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="RegisterCheck"><soap:operation soapAction="http://tempuri.org/IMyService/RegisterCheck" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetCustomerById"><soap:operation soapAction="http://tempuri.org/IMyService/GetCustomerById" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetProducts"><soap:operation soapAction="http://tempuri.org/IMyService/GetProducts" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetProductsFromCustomer"><soap:operation soapAction="http://tempuri.org/IMyService/GetProductsFromCustomer" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="BuyProduct"><soap:operation soapAction="http://tempuri.org/IMyService/BuyProduct" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="MyService"><wsdl:port name="BasicHttpBinding_IMyService" binding="tns:BasicHttpBinding_IMyService"><soap:address location="http://localhost:8733/Design_Time_Addresses/WebshopService/Service1/"/></wsdl:port></wsdl:service></wsdl:definitions>