get_customer_by_id.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
  <soap:Header/>
  <soap:Body>
    <tem:GetCustomerById>
      <tem:customerId>1</tem:customerId>
    </tem:GetCustomerById>
  </soap:Body>
</soap:Envelope>
